NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG21/EFR32MG21A010F768IM32.svd
        <register>
          <name>BLEIQDSAEXT1</name>
          <description>No Description</description>
          <addressOffset>0x234</addressOffset>
          <access>read-write</access>
          <resetValue>0x0E000000</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>FREQSCALEIQDSA</name>
              <description>I/Q DSA Frequency scale</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPWRFIRAVGEN</name>
              <description>Channel Power FIR Avg Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHPWRFIRAVGVAL</name>
              <description>Channel Power FIR Avg Value</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AVG0</name>
                  <description>No Avg</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG2</name>
                  <description>2 sample avg</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG4</name>
                  <description>4 sample avg</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AVG8</name>
                  <description>8 sample avg</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CORRIIRAVGMULFACT</name>
              <description>Corr IIR Avg Multiplication Factor</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEIQDSAADDRBIAS</name>
              <description>BLEIQDSA ADDRBIAS</description>
              <bitOffset>7</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLEIQDSATHCOMB</name>
              <description>Threshold when i and q are added</description>
              <bitOffset>11</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MAXCORRCNTIQDSA</name>
              <description>Max Corr Cnt IQDSA</description>
              <bitOffset>25</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IIRRST</name>
              <description>IIR Reset</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCPROPERTIES</name>
          <description>No Description</description>
          <addressOffset>0x238</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>SYNCCORRCLR</name>
              <description>Sync auto corr clear bit </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCSECPEAKTH</name>
              <description>SYNC auto corr second peak threshold</description>
              <bitOffset>1</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DIGIGAINCTRL</name>
          <description>No Description</description>
          <addressOffset>0x23C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000001FF</resetMask>
          <fields>
            <field>
              <name>DIGIGAINEN</name>
              <description>Digital Gain Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGIGAINSEL</name>
              <description>Digital Gain Select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GAINM3</name>
                  <description>GAINM3 </description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P75</name>
                  <description>GAINM2P75</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P5</name>
                  <description>GAINM2P5 </description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2P25</name>
                  <description>GAINM2P25</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM2</name>
                  <description>GAINM2 </description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P75</name>
                  <description>GAINM1P75</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P5</name>
                  <description>GAINM1P5 </description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1P25</name>
                  <description>GAINM1P25</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM1</name>
                  <description>GAINM1 </description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P75</name>
                  <description>GAINM0P75</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P5</name>
                  <description>GAINM0P5 </description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0P25</name>
                  <description>GAINM0P25</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINM0</name>
                  <description>GAINM0 </description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P25</name>
                  <description>GAINP0P25</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P5</name>
                  <description>GAINP0P5 </description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP0P75</name>
                  <description>GAINP0P75</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1</name>
                  <description>GAINP1 </description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P25</name>
                  <description>GAINP1P25</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P5</name>
                  <description>GAINP1P5 </description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP1P75</name>
                  <description>GAINP1P75</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2</name>
                  <description>GAINP2 </description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P25</name>
                  <description>GAINP2P25</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P5</name>
                  <description>GAINP2P5 </description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP2P75</name>
                  <description>GAINP2P75</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GAINP3</name>
                  <description>GAINP3 </description>
                  <value>24</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIGIGAINDOUBLE</name>
              <description>Digital Gain Doubled</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIGIGAINHALF</name>
              <description>Digital Gain Halved</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DEC0GAIN</name>
              <description>DEC0 Gain Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRSCTRL</name>
          <description>No Description</description>
          <addressOffset>0x240</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>POSTPONESEL</name>
              <description></description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADVANCESEL</name>
              <description></description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NEWWNDSEL</name>
              <description></description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WEAKSEL</name>
              <description></description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNCSENTSEL</name>
              <description></description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PRESENTSEL</name>
              <description></description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LOWCORRSEL</name>
              <description></description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT0SEL</name>
              <description></description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANT1SEL</name>
              <description></description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEFWR0</name>
          <description>No Description</description>
          <addressOffset>0x250</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRVWD</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWD</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IRCALCOEFWR1</name>
          <description>No Description</description>
          <addressOffset>0x254</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRVWD</name>
              <description>CRV coefficient</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CRVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWD</name>
              <description>CIV coefficient</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CIVWEN</name>
              <description>CIV Coefficient Write Enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
